.presentation/.generated/InMemoryClusterTest - can load stock list and order item.md
```mermaid
sequenceDiagram
    title InMemoryClusterTest - can load stock list and order item - Sequence
    participant Website User
	participant api_gateway
	participant website
	participant warehouse
	participant images
	participant cognito
	participant db
	participant image_cache_s3_eu_west_1_amazonaws_com
	participant dept_store
	participant email_eu_west_1_amazonaws_com
	participant event_stream

    Website User->>api_gateway: GET 
    activate api_gateway
    
    api_gateway->>Website User: 307 Temporary Redirect
    deactivate api_gateway
    
	
    Website User->>cognito: GET oauth2/authorize
    activate cognito
    
    cognito->>Website User: 302 Found
    deactivate cognito
    
	
    Website User->>cognito: GET oauth2/login
    activate cognito
    
    cognito->>Website User: 200 OK
    deactivate cognito
    
	
    Website User->>cognito: POST oauth2/login
    activate cognito
    
    cognito->>Website User: 303 See Other
    deactivate cognito
    
	
    Website User->>api_gateway: GET oauth/callback
    activate api_gateway
    
    api_gateway->>cognito: POST oauth2/token
    activate cognito
    
    cognito->>api_gateway: 200 OK
    deactivate cognito
    
    api_gateway->>Website User: 307 Temporary Redirect
    deactivate api_gateway
    
	
    Website User->>api_gateway: GET 
    activate api_gateway
    
    api_gateway->>website: GET 
    activate website
    
    website->>warehouse: GET v1/items
    activate warehouse
    
    warehouse->>db: items
    
    db->>warehouse: 
    
    warehouse->>website: 200 OK
    deactivate warehouse
    
    website->>api_gateway: 200 OK
    deactivate website
    
    api_gateway->>Website User: 200 OK
    deactivate api_gateway
    
	
    Website User->>api_gateway: GET img/{.+}
    activate api_gateway
    
    api_gateway->>images: GET img/{id}
    activate images
    
    images->>image_cache_s3_eu_west_1_amazonaws_com: GET {bucketKey:.+}
    activate image_cache_s3_eu_west_1_amazonaws_com
    
    image_cache_s3_eu_west_1_amazonaws_com->>images: 200 OK
    deactivate image_cache_s3_eu_west_1_amazonaws_com
    
    images->>api_gateway: 200 OK
    deactivate images
    
    api_gateway->>Website User: 200 OK
    deactivate api_gateway
    
	
    Website User->>api_gateway: POST order/{id}
    activate api_gateway
    
    api_gateway->>website: POST order/{id}
    activate website
    
    website->>warehouse: POST v1/dispatch
    activate warehouse
    
    warehouse->>db: items
    
    db->>warehouse: 
    
	
    warehouse->>db: adjust
    
    db->>warehouse: 
    
	
    warehouse->>dept_store: POST v1/order
    activate dept_store
    
    dept_store->>warehouse: 200 OK
    deactivate dept_store
    
    warehouse->>website: 202 Accepted
    deactivate warehouse
    
	
    website->>email_eu_west_1_amazonaws_com: POST 
    activate email_eu_west_1_amazonaws_com
    
    email_eu_west_1_amazonaws_com->>website: 200 OK
    deactivate email_eu_west_1_amazonaws_com
    
	
    website-)event_stream: CustomerOrder(item=1)
    
    
    website->>api_gateway: 200 OK
    deactivate website
    
    api_gateway->>Website User: 200 OK
    deactivate api_gateway
    
```
